# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [2]:
import  numpy as np
import  pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [3]:
a=pd.Series([100,200,300,400])

Print a, and data type

In [4]:

print(a)
print(a.dtype)

0    100
1    200
2    300
3    400
dtype: int64
int64

Using indexing access the element 300 from the series a.

In [5]:
print(a[2]) # Accessing the third element (index 2) of the Series

300

What are the values of index for series a?

In [6]:
0
1
2
3

3

Change the index to  ['c', 'a', 'b', 'd']

In [7]:
series = pd.Series([100, 200, 300, 400], index=['c', 'a', 'b', 'd'])                
print(series)  # Display the Series with custom indices

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [9]:
print(series["d"])

400

Sort the values wrt to the index and print it

In [10]:

print(series.sort_index())

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [11]:
b = pd.Series([800, 450, 100], index=['e', 'f', 'g'])                       
print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [12]:
a =pd.concat([series,b])

In [13]:
#print a again after appending b into it
print(a)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [14]:
# a = a.sort_index()
print(a.sort_index())  # Display the sorted Series by index

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [15]:
df = pd.DataFrame(a)
print(df)  # Display the DataFrame

     0
c  100
a  200
b  300
d  400
e  800
f  450
g  100

What is the shape of the datafarme <br>
(also, what does it imply?)

In [16]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [17]:
# yep its same as the series.
a.index

Index(['c', 'a', 'b', 'd', 'e', 'f', 'g'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [18]:
#df.head()
df.tail()

     0
b  300
d  400
e  800
f  450
g  100

Rename the column of the dataframe as 'points'

In [19]:

df.columns=['points']
print(df)  # Display the DataFrame with renamed columns

   points
c     100
a     200
b     300
d     400
e     800
f     450
g     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [20]:
#Create fruits array

fruits = np.array(['orange','mango','apple','apple','orange','mango','mango'])

In [21]:
#Create series fruits out of fruits array

fruits =pd.Series(fruits)

Change the index of fruits to the index of dataframe df

In [22]:
fruits.index = df.index

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [23]:

df=pd.concat([df,fruits],axis=1)
df.rename(columns={0:'fruits'},inplace=True)
print(df.head())  # Display the final DataFrame with both columns

   points  fruits
c     100  orange
a     200   mango
b     300   apple
d     400   apple
e     800  orange

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [24]:
d1 = pd.DataFrame({'city' : ['Chandigarh','Delhi','Kanpur','Chennai','Manali'], 'Temperature' : [15,22,20,26,-2]})

Print(d1)

In [25]:
d1

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [26]:
d1.shape

(5, 2)

Set city = d1['city']

In [27]:
city = d1['city']

print city <br>
What is the type of city.

In [28]:
print(city)
d1['city'].dtype

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

dtype('O')

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [29]:
d2 = pd.DataFrame({'city' : ['Bengalaru','Coimbatore','Srirangam','pondicherry'], 'Temperature' : [24,35,36,39]})

print the shape of this dataframe

In [30]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [31]:
d3 = pd.merge(d1, d2, on ='city')  # This will give an error since there are no common cities to merge on
print(d3)

Empty DataFrame
Columns: [city, Temperature_x, Temperature_y]
Index: []

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [32]:
cold_cities=d1[d1['Temperature'] <= 20][['city']]
print(cold_cities)

         city
0  Chandigarh
2      Kanpur
4      Manali

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [33]:
hot_cities=d2[d2['Temperature'] >= 35][['city']]
print(hot_cities)

          city
1   Coimbatore
2    Srirangam
3  pondicherry

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [34]:
# write function here

def is_ut(city):                     
#     # write code below     
    ut_cities = ['chandigarh', 'delhi', 'pondicherry']      
    return city.lower() in ut_cities      
     
d1['is_ut'] = d1['city'].apply(is_ut)                     
print(d1)  # Display d1 with the new 'is_ut' column indicating if the city is a union territory or not

         city  Temperature  is_ut
0  Chandigarh           15   True
1       Delhi           22   True
2      Kanpur           20  False
3     Chennai           26  False
4      Manali           -2  False

In [35]:
# print d3
print(d1)                           
#is_ut(city)

         city  Temperature  is_ut
0  Chandigarh           15   True
1       Delhi           22   True
2      Kanpur           20  False
3     Chennai           26  False
4      Manali           -2  False

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [36]:
# write function here
def c_f(temp):                     
    # write code below     
    return (temp * 9/5) + 32

In [37]:
# check function c_to_f(10)
print(c_f(10))

50.0

In [38]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
def temp_farenhiet(temp):
    return (temp * 9/5) + 32        
d1['temp_farenhiet'] = d1['Temperature'].apply(temp_farenhiet)                     
print(d1)  # Display d3 with the new 'temp_farenhiet' column

         city  Temperature  is_ut  temp_farenhiet
0  Chandigarh           15   True            59.0
1       Delhi           22   True            71.6
2      Kanpur           20  False            68.0
3     Chennai           26  False            78.8
4      Manali           -2  False            28.4

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [39]:
ut_cities = ['Chandigarh','Delhi','pondicherry']
d1_ut = d1[d1['city'].isin(ut_cities)]                     
print(d1_ut)  # Display d1_ut containing only the union territory cities

         city  Temperature  is_ut  temp_farenhiet
0  Chandigarh           15   True            59.0
1       Delhi           22   True            71.6

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [40]:
#hot_cities = d1[d1['temp_farenhiet'] > 90]
hot_cities = d1.loc[d1['temp_farenhiet'] > 90, 'city']                        
d1_ut = d1[d1['city'].isin(hot_cities)]                     
print(d1_ut)

Empty DataFrame
Columns: [city, Temperature, is_ut, temp_farenhiet]
Index: []

Select only the first three rows of the dataframe d1.

In [41]:
d1_3 = d1.head(3)
print(d1_3)  # Display the first three rows of d1_ut

         city  Temperature  is_ut  temp_farenhiet
0  Chandigarh           15   True            59.0
1       Delhi           22   True            71.6
2      Kanpur           20  False            68.0

Select all the rows and last two columns in the dataframe.

In [42]:
d1_last2 = d1.iloc[:,-2:]
print(d1_last2)  # Display the last two columns of d1

   is_ut  temp_farenhiet
0   True            59.0
1   True            71.6
2  False            68.0
3  False            78.8
4  False            28.4

## Groupby

In [43]:
# Create a dataframe using dictionary of your choice

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
      'Age': [24, 27, 22, 32], 'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}  
df = pd.DataFrame(data)

In [44]:
# Use Groupby of single column with aggregate sum()
sum_age = df.groupby('City')['Age'].sum()
print(sum_age)  # Display the sum of ages for each city

City
Chicago        22
Houston        32
Los Angeles    27
New York       24
Name: Age, dtype: int64

In [45]:
# Use Groupby of single column with aggregate count()
count_age = df.groupby('City')['Age'].count()
print(count_age)  # Display the count of ages for each city

City
Chicago        1
Houston        1
Los Angeles    1
New York       1
Name: Age, dtype: int64

In [46]:
# Use Groupby of single column with aggregate min() and max()
min_age = df.groupby('City')['Age'].min()
max_age = df.groupby('City')['Age'].max()
print("Minimum ages by city:\n", min_age)  # Display the minimum age for each city
print("Maximum ages by city:\n", max_age)  # Display the maximum age for each city

Minimum ages by city:
 City
Chicago        22
Houston        32
Los Angeles    27
New York       24
Name: Age, dtype: int64
Maximum ages by city:
 City
Chicago        22
Houston        32
Los Angeles    27
New York       24
Name: Age, dtype: int64

In [48]:
# Use Groupby of any 2 columns with aggregate mean()
mean_age = df.groupby(['City', 'Name'])['Age'].mean()
print(mean_age)  # Display the mean age for each city and name combination

City         Name
Chicago      Charlie    22.0
Houston      David      32.0
Los Angeles  Bob        27.0
New York     Alice      24.0
Name: Age, dtype: float64

In [49]:
# Use Groupby of any 2 columns with aggregate min() and max()
min_age_2 = df.groupby(['City', 'Name'])['Age'].min()
max_age_2 = df.groupby(['City', 'Name'])['Age'].max()
print("Minimum ages by city and name:\n", min_age_2)  # Display the minimum age for each city and name combination
print("Maximum ages by city and name:\n", max_age_2)  # Display the maximum age for each city and name combination

Minimum ages by city and name:
 City         Name
Chicago      Charlie    22
Houston      David      32
Los Angeles  Bob        27
New York     Alice      24
Name: Age, dtype: int64
Maximum ages by city and name:
 City         Name
Chicago      Charlie    22
Houston      David      32
Los Angeles  Bob        27
New York     Alice      24
Name: Age, dtype: int64

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [50]:
a = pd.date_range(start='2020-01-01',end='2021-04-01')

print a

In [51]:

print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [52]:


print(len(a))

457

What is the type of a?

In [53]:
print(type(a))

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>